experiments/wrk2/wrk2-18/out.txt
Running 2m test @ http://192.168.1.2
  10 threads and 200 connections
  Thread calibration: mean lat.: 1582.921ms, rate sampling interval: 5636ms
  Thread calibration: mean lat.: 1577.876ms, rate sampling interval: 5533ms
  Thread calibration: mean lat.: 1503.345ms, rate sampling interval: 5423ms
  Thread calibration: mean lat.: 1534.521ms, rate sampling interval: 5357ms
  Thread calibration: mean lat.: 1502.529ms, rate sampling interval: 5378ms
  Thread calibration: mean lat.: 1486.751ms, rate sampling interval: 5279ms
  Thread calibration: mean lat.: 1501.693ms, rate sampling interval: 5353ms
  Thread calibration: mean lat.: 1497.080ms, rate sampling interval: 5218ms
  Thread calibration: mean lat.: 1497.640ms, rate sampling interval: 5365ms
  Thread calibration: mean lat.: 1565.366ms, rate sampling interval: 5423ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.25s     9.44s   37.91s    57.87%
    Req/Sec    18.01k   208.86    18.59k    66.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.23s 
 75.000%   27.38s 
 90.000%   32.31s 
 99.000%   35.75s 
 99.900%   36.93s 
 99.990%   37.58s 
 99.999%   37.85s 
100.000%   37.95s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2441.215     0.000000            4         1.00
    6225.919     0.100000      1980377         1.11
    9469.951     0.200000      3958684         1.25
   12713.983     0.300000      5938442         1.43
   15974.399     0.400000      7914700         1.67
   19234.815     0.500000      9898495         2.00
   20840.447     0.550000     10888260         2.22
   22478.847     0.600000     11879229         2.50
   24100.863     0.650000     12864014         2.86
   25739.263     0.700000     13857694         3.33
   27377.663     0.750000     14840402         4.00
   28213.247     0.775000     15338879         4.44
   29032.447     0.800000     15827674         5.00
   29851.647     0.825000     16325657         5.71
   30670.847     0.850000     16822101         6.67
   31490.047     0.875000     17313009         8.00
   31916.031     0.887500     17566279         8.89
   32309.247     0.900000     17807237        10.00
   32735.231     0.912500     18056979        11.43
   33144.831     0.925000     18302380        13.33
   33554.431     0.937500     18549880        16.00
   33783.807     0.943750     18689094        17.78
   33980.415     0.950000     18802701        20.00
   34177.023     0.956250     18920043        22.86
   34406.399     0.962500     19046995        26.67
   34668.543     0.968750     19175194        32.00
   34799.615     0.971875     19236717        35.56
   34930.687     0.975000     19298729        40.00
   35061.759     0.978125     19352087        45.71
   35225.599     0.981250     19419554        53.33
   35389.439     0.984375     19480147        64.00
   35487.743     0.985938     19511602        71.11
   35586.047     0.987500     19543884        80.00
   35684.351     0.989062     19572915        91.43
   35782.655     0.990625     19600063       106.67
   35913.727     0.992188     19634626       128.00
   35979.263     0.992969     19650356       142.22
   36044.799     0.993750     19661124       160.00
   36143.103     0.994531     19682635       182.86
   36208.639     0.995313     19695342       213.33
   36306.943     0.996094     19710076       256.00
   36339.711     0.996484     19715970       284.44
   36405.247     0.996875     19725185       320.00
   36470.783     0.997266     19733281       365.71
   36536.319     0.997656     19739846       426.67
   36601.855     0.998047     19745619       512.00
   36667.391     0.998242     19750753       568.89
   36732.927     0.998437     19755298       640.00
   36765.695     0.998633     19757267       731.43
   36831.231     0.998828     19761437       853.33
   36929.535     0.999023     19765372      1024.00
   36995.071     0.999121     19767190      1137.78
   37027.839     0.999219     19768628      1280.00
   37093.375     0.999316     19771426      1462.86
   37126.143     0.999414     19773025      1706.67
   37158.911     0.999512     19774470      2048.00
   37191.679     0.999561     19775375      2275.56
   37257.215     0.999609     19776518      2560.00
   37322.751     0.999658     19777585      2925.71
   37388.287     0.999707     19779130      3413.33
   37421.055     0.999756     19779893      4096.00
   37421.055     0.999780     19779893      4551.11
   37453.823     0.999805     19780144      5120.00
   37519.359     0.999829     19780888      5851.43
   37552.127     0.999854     19781303      6826.67
   37584.895     0.999878     19782069      8192.00
   37584.895     0.999890     19782069      9102.22
   37584.895     0.999902     19782069     10240.00
   37617.663     0.999915     19782493     11702.86
   37650.431     0.999927     19782808     13653.33
   37650.431     0.999939     19782808     16384.00
   37683.199     0.999945     19782965     18204.44
   37715.967     0.999951     19783215     20480.00
   37715.967     0.999957     19783215     23405.71
   37748.735     0.999963     19783564     27306.67
   37748.735     0.999969     19783564     32768.00
   37748.735     0.999973     19783564     36408.89
   37748.735     0.999976     19783564     40960.00
   37748.735     0.999979     19783564     46811.43
   37781.503     0.999982     19783660     54613.33
   37814.271     0.999985     19783681     65536.00
   37847.039     0.999986     19783848     72817.78
   37847.039     0.999988     19783848     81920.00
   37847.039     0.999989     19783848     93622.86
   37847.039     0.999991     19783848    109226.67
   37847.039     0.999992     19783848    131072.00
   37847.039     0.999993     19783848    145635.56
   37879.807     0.999994     19783883    163840.00
   37879.807     0.999995     19783883    187245.71
   37912.575     0.999995     19783956    218453.33
   37912.575     0.999996     19783956    262144.00
   37912.575     0.999997     19783956    291271.11
   37912.575     0.999997     19783956    327680.00
   37912.575     0.999997     19783956    374491.43
   37912.575     0.999998     19783956    436906.67
   37912.575     0.999998     19783956    524288.00
   37912.575     0.999998     19783956    582542.22
   37912.575     0.999998     19783956    655360.00
   37912.575     0.999999     19783956    748982.86
   37912.575     0.999999     19783956    873813.33
   37945.343     0.999999     19783975   1048576.00
   37945.343     1.000000     19783975          inf
#[Mean    =    19252.566, StdDeviation   =     9436.134]
#[Max     =    37912.576, Total count    =     19783975]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    0.94ms
 75.000%    1.33ms
 90.000%    1.75ms
 99.000%    4.44ms
 99.900%    9.09ms
 99.990%   15.94ms
 99.999%   21.65ms
100.000%   32.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.075     0.000000            1         1.00
       0.537     0.100000      1982815         1.11
       0.674     0.200000      3969206         1.25
       0.743     0.300000      5946844         1.43
       0.881     0.400000      7922147         1.67
       0.943     0.500000      9900506         2.00
       0.995     0.550000     10888806         2.22
       1.093     0.600000     11870960         2.50
       1.146     0.650000     12860373         2.86
       1.204     0.700000     13853753         3.33
       1.326     0.750000     14845213         4.00
       1.369     0.775000     15336270         4.44
       1.412     0.800000     15836241         5.00
       1.476     0.825000     16324121         5.71
       1.568     0.850000     16822021         6.67
       1.637     0.875000     17311147         8.00
       1.681     0.887500     17560255         8.89
       1.746     0.900000     17808902        10.00
       1.810     0.912500     18055070        11.43
       1.868     0.925000     18303525        13.33
       1.947     0.937500     18549818        16.00
       2.002     0.943750     18673330        17.78
       2.055     0.950000     18797886        20.00
       2.107     0.956250     18919159        22.86
       2.177     0.962500     19043426        26.67
       2.271     0.968750     19167785        32.00
       2.319     0.971875     19228994        35.56
       2.377     0.975000     19290772        40.00
       2.455     0.978125     19352335        45.71
       2.547     0.981250     19413073        53.33
       2.683     0.984375     19475483        64.00
       2.779     0.985938     19505770        71.11
       2.931     0.987500     19536760        80.00
       3.337     0.989062     19567606        91.43
       4.599     0.990625     19598671       106.67
       4.839     0.992188     19630006       128.00
       4.943     0.992969     19645274       142.22
       5.055     0.993750     19660530       160.00
       5.179     0.994531     19675940       182.86
       5.327     0.995313     19691420       213.33
       5.515     0.996094     19706966       256.00
       5.627     0.996484     19714460       284.44
       5.771     0.996875     19722225       320.00
       5.963     0.997266     19729977       365.71
       6.267     0.997656     19737679       426.67
       7.611     0.998047     19745346       512.00
       8.487     0.998242     19749281       568.89
       8.655     0.998437     19753149       640.00
       8.799     0.998633     19757037       731.43
       8.943     0.998828     19760848       853.33
       9.111     0.999023     19764730      1024.00
       9.207     0.999121     19766593      1137.78
       9.327     0.999219     19768594      1280.00
       9.463     0.999316     19770514      1462.86
       9.663     0.999414     19772442      1706.67
       9.967     0.999512     19774346      2048.00
      10.223     0.999561     19775298      2275.56
      10.927     0.999609     19776248      2560.00
      12.287     0.999658     19777216      2925.71
      12.655     0.999707     19778205      3413.33
      12.895     0.999756     19779157      4096.00
      13.015     0.999780     19779630      4551.11
      13.183     0.999805     19780124      5120.00
      13.415     0.999829     19780608      5851.43
      13.711     0.999854     19781081      6826.67
      14.311     0.999878     19781560      8192.00
      15.151     0.999890     19781802      9102.22
      16.143     0.999902     19782043     10240.00
      16.639     0.999915     19782287     11702.86
      16.847     0.999927     19782529     13653.33
      17.087     0.999939     19782783     16384.00
      17.215     0.999945     19782898     18204.44
      17.343     0.999951     19783021     20480.00
      17.519     0.999957     19783141     23405.71
      17.903     0.999963     19783255     27306.67
      18.879     0.999969     19783373     32768.00
      20.527     0.999973     19783434     36408.89
      20.671     0.999976     19783494     40960.00
      20.831     0.999979     19783557     46811.43
      20.975     0.999982     19783618     54613.33
      21.151     0.999985     19783675     65536.00
      21.327     0.999986     19783704     72817.78
      21.487     0.999988     19783734     81920.00
      21.599     0.999989     19783765     93622.86
      21.839     0.999991     19783796    109226.67
      22.447     0.999992     19783826    131072.00
      23.215     0.999993     19783840    145635.56
      24.255     0.999994     19783855    163840.00
      24.527     0.999995     19783875    187245.71
      24.607     0.999995     19783886    218453.33
      24.895     0.999996     19783903    262144.00
      24.927     0.999997     19783908    291271.11
      25.007     0.999997     19783915    327680.00
      25.071     0.999997     19783923    374491.43
      25.263     0.999998     19783930    436906.67
      28.447     0.999998     19783938    524288.00
      28.607     0.999998     19783943    582542.22
      28.703     0.999998     19783945    655360.00
      28.735     0.999999     19783949    748982.86
      28.751     0.999999     19783953    873813.33
      28.783     0.999999     19783957   1048576.00
      28.815     0.999999     19783959   1165084.44
      28.959     0.999999     19783960   1310720.00
      29.103     0.999999     19783962   1497965.71
      29.183     0.999999     19783964   1747626.67
      29.215     1.000000     19783967   2097152.00
      29.215     1.000000     19783967   2330168.89
      29.247     1.000000     19783969   2621440.00
      29.247     1.000000     19783969   2995931.43
      29.263     1.000000     19783970   3495253.33
      29.375     1.000000     19783971   4194304.00
      29.375     1.000000     19783971   4660337.78
      30.991     1.000000     19783972   5242880.00
      30.991     1.000000     19783972   5991862.86
      31.087     1.000000     19783973   6990506.67
      31.087     1.000000     19783973   8388608.00
      31.087     1.000000     19783973   9320675.55
      31.727     1.000000     19783974  10485760.00
      31.727     1.000000     19783974  11983725.71
      31.727     1.000000     19783974  13981013.34
      31.727     1.000000     19783974  16777216.00
      31.727     1.000000     19783974  18641351.10
      32.447     1.000000     19783975  20971519.98
      32.447     1.000000     19783975          inf
#[Mean    =        1.102, StdDeviation   =        0.733]
#[Max     =       32.432, Total count    =     19783975]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  21590685 requests in 2.00m, 17.27GB read
Requests/sec: 179923.46
Transfer/sec:    147.39MB